//Выполнить операции и описать действия интерпретатора javascript, связанные с преобразованием типов по каждому пункту:

//1. 5 > 4
console.log(5 > 4)
// сравнение одинаковых типов == true

//2. "ананас" > "яблоко"
console.log("ананас" > "яблоко")
// сравнение первой буквы == false

//3. "2" > "12"
console.log("2" > "12")
// сравнение первых символов == true

//4. undefined == null
console.log(undefined == null)
// значения undefined = NAN  null = 0 равны друг другу == true

//5. undefined === null
console.log(undefined === null)
// разные типы == false

//6. null == "\n0\n"
console.log(null == "\n0\n")
// null ни к чему не приводится, "\n0\n" = 0 == false

//7. null === +"\n0\n"
console.log(null === "\n0\n")
// разные типы == false

//8. "" + 1 + 0
console.log("" + 1 + 0)
// приведение к строке == "10"

//9. "" - 1 + 0
console.log("" - 1 + 0)
// приведение к числу 0 -1 + 0 == -1

//10. true + false
console.log(true + false)
// приведение к числу 1 + 0 == 1

//11. 6 / "3"
console.log(6 / "3")
// приведение к числу 6 / 3 == 2

//12. "2" * "3"
console.log("2" * "3")
// приведение к числу 2 * 3 == 6

//13. 4 + 5 + "px"
console.log(4 + 5 + "px")
// приведение к числу 4 + 5 == 9, приведение к строке "9" + "px" == "9px"

//14. "$" + 4 + 5
console.log("$" + 4 + 5)
// приведение к строке "$" + "4" == "$4", приведение к строке "$4" + "5" == "$45"

//15. "4" - 2
console.log("4" - 2)
// приведение к числу 4 - 2 == 2

//16. "4px" - 2
console.log("4px" - 2)
// приведение к числу NAN - 2 == NAN

//17. 7 / 0
console.log(7 / 0)
// enfinity

//18. "  -9  " + 5
console.log("  -9  " + 5)
// привежение к строке " -9 " + "5" == " -9 5"

//19. "  -9  " - 5
console.log("  -9  " - 5)
// привидение к числу -9 - 5 == -14

//20. null + 1
console.log(null + 1)
// приведение к числу 0 + 1 == 1

//21. undefined + 1
console.log(undefined + 1)
// приведение к числу NAN + 1 == NAN

//22. " \t \n" - 2
console.log(" \t \n" - 2)
// \t - символ табуляции, \n - символ переноса строки, получаем пустую строку, приводим к числу 0 - 2 == -2